In [69]:
import numpy as np
import pandas as pd
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [70]:
df = pd.read_csv('train.csv')[['Age','Pclass','SibSp','Parch','Survived']]
df.head(4)

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1

In [71]:
df.shape

(891, 5)

In [72]:
df.isnull().sum()

Age         177
Pclass        0
SibSp         0
Parch         0
Survived      0
dtype: int64

In [73]:
df.dropna(inplace=True)

In [74]:
df.shape

(714, 5)

In [75]:
X = df.iloc[:,0:4]
y = df.iloc[:,-1]

X.sample(5)

      Age  Pclass  SibSp  Parch
14   14.0       3      0      0
641  24.0       1      0      0
273  37.0       1      0      1
393  23.0       1      1      0
399  28.0       2      0      0

In [76]:
print("Cross Validation Score : ")
print(np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv=20)))

Cross Validation Score :
0.6933333333333332

## Feature Construction :

Process of creating `New` and Useful `features` from existing data in order to improve Accurracy

In [77]:
X['Family_size'] = X['SibSp'] + X['Parch'] + 1
X.head()

    Age  Pclass  SibSp  Parch  Family_size
0  22.0       3      1      0            2
1  38.0       1      1      0            2
2  26.0       3      0      0            1
3  35.0       1      1      0            2
4  35.0       3      0      0            1

In [78]:
def myfun(num):
    if (num == 1):
        return  0   #Alone
    elif(num>1 and num<=4):
        return 1    #Small Family
    else:
        return 2    #Large Family

In [79]:
myfun(23) , myfun(3) , myfun(1)

(2, 1, 0)

In [80]:
X['Family_type'] = X['Family_size'].apply(myfun)
X.sample(5)

      Age  Pclass  SibSp  Parch  Family_size  Family_type
659  58.0       1      0      2            3            1
799  30.0       3      1      1            3            1
747  30.0       2      0      0            1            0
172   1.0       3      1      1            3            1
548  33.0       3      1      1            3            1

In [81]:
X.drop(columns=['SibSp','Parch','Family_size'],inplace=True)
X.sample(5)

      Age  Pclass  Family_type
421  21.0       3            0
352  15.0       3            1
68   17.0       3            2
134  25.0       2            0
528  39.0       3            0

In [82]:
print("Cross Validation Score : ")
print(np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv=20)))

Cross Validation Score :
0.7003174603174602

## Feature Splitting :

It is the process of breaking down a single, complex feature into multiple, more informative `sub-features`.

In [83]:
df2 = pd.read_csv('train.csv')
df2.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [84]:
df2['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [85]:
# [1] => Content after (,)  ,  [0] => Content before (,)
df2['Name'].str.split(', ',expand=True)

             0                                           1
0       Braund                             Mr. Owen Harris
1      Cumings  Mrs. John Bradley (Florence Briggs Thayer)
2    Heikkinen                                 Miss. Laina
3     Futrelle          Mrs. Jacques Heath (Lily May Peel)
4        Allen                           Mr. William Henry
..         ...                                         ...
886   Montvila                                 Rev. Juozas
887     Graham                        Miss. Margaret Edith
888   Johnston              Miss. Catherine Helen "Carrie"
889       Behr                             Mr. Karl Howell
890     Dooley                                 Mr. Patrick

[891 rows x 2 columns]

In [86]:
# [1] => Content after (.)  ,  [0] => Content before (.)
df2['Name'].str.split(', ',expand=True)[1].str.split('.',expand=True)

        0                                       1     2
0      Mr                             Owen Harris  None
1     Mrs   John Bradley (Florence Briggs Thayer)  None
2    Miss                                   Laina  None
3     Mrs           Jacques Heath (Lily May Peel)  None
4      Mr                           William Henry  None
..    ...                                     ...   ...
886   Rev                                  Juozas  None
887  Miss                          Margaret Edith  None
888  Miss                Catherine Helen "Carrie"  None
889    Mr                             Karl Howell  None
890    Mr                                 Patrick  None

[891 rows x 3 columns]

In [87]:
df2['Title'] = df2['Name'].str.split(', ',expand=True)[1].str.split('.',expand=True)[0]
df2.sample(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,NaN,S,Master
337,338,1,1,"Burns, Miss. Elizabeth Margaret",female,41.0,0,0,16966,134.5,E40,C,Miss
641,642,1,1,"Sagesser, Mlle. Emma",female,24.0,0,0,PC 17477,69.3,B35,C,Mlle

In [88]:
df2[['Title','Name']]

    Title                                               Name
0      Mr                            Braund, Mr. Owen Harris
1     Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    Miss                             Heikkinen, Miss. Laina
3     Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4      Mr                           Allen, Mr. William Henry
..    ...                                                ...
886   Rev                              Montvila, Rev. Juozas
887  Miss                       Graham, Miss. Margaret Edith
888  Miss           Johnston, Miss. Catherine Helen "Carrie"
889    Mr                              Behr, Mr. Karl Howell
890    Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [89]:
(df2.groupby('Title')['Survived'].mean()).sort_values(ascending=False)

Title
the Countess    1.000000
Mlle            1.000000
Sir             1.000000
Ms              1.000000
Lady            1.000000
Mme             1.000000
Mrs             0.792000
Miss            0.697802
Master          0.575000
Col             0.500000
Major           0.500000
Dr              0.428571
Mr              0.156673
Jonkheer        0.000000
Rev             0.000000
Don             0.000000
Capt            0.000000
Name: Survived, dtype: float64

In [90]:
df2['IsMarried'] = 0
df2['IsMarried'].loc[df2['Title'] == 'Mrs'] = 1

In [94]:
df2.sample(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,IsMarried
527,528,0,1,"Farthing, Mr. John",male,NaN,0,0,PC 17483,221.7792,C95,S,Mr,0
218,219,1,1,"Bazzani, Miss. Albina",female,32.0,0,0,11813,76.2917,D15,C,Miss,0
662,663,0,1,"Colley, Mr. Edward Pomeroy",male,47.0,0,0,5727,25.5875,E58,S,Mr,0